cosim_main/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    topAndBottom
    {
        type            patch;
        nFaces          480;
        startFace       77416;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       77896;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       78016;
    }
    wing_main
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          292;
        startFace       78136;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          95;
        startFace       78428;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          38817;
        startFace       78523;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          38817;
        startFace       117340;
    }
)

// ************************************************************************* //
